
// визначення середньої 
// добової дози (ADD/LADD),  формула розрахунку якої за інгаляційного 
// впливу речовини з атмосферного повітря
function serednyaDobovaDoza(Ca, Ch, Tout, Tin, Vout, Vin, EF, ED, BW, AT) {
    
    let ADD = ((Ca * Tout * Vout) + (Ch * Tin * Vin)) * EF * ED;
    let LADD = BW * AT * 365;
    let result = [ADD, LADD];
    return result;
}

// порівняння    фактичних   рівнів   експозиції 
// з безпечними  (референтними)   рівнями   впливу   та   визначенням 
// коефіцієнта небезпеки:
function koeficientNebezpekyObsh(AD=-1, AC=-1, RfD=-1, RfC=-1) {
    
    let HQ;
    if (AD == -1 && RfD == -1) {
        HQ = AC / RfC;
    }
    if (AC == -1 && RfC == -1) {
        HQ = AD / RfD;
    }
    else {
        return false;
    }
    return HQ;
}

// За    інгаляційного    надходження,    якщо    цього 
// не потребують спеціальні задачі  дослідження,  немає  необхідності 
// розраховувати  дозу  впливу
function koeficientNebezpekyRechovyny (C, RfC) {
    return C/RfC;
}

//  Критерії неканцерогенного ризику 
function isDangerous(HQ) {
    if (HQ > 1) {
        return "Імовірність розвитку шкідливих ефектів зростає пропорційно збільшенню HQ";
    }
    else if (HQ < 1) {
        return "Ризик виникнення шкідливих ефектів розглядають як зневажливо малий";
    }
    else if (HQ == 1) {
        return "Гранична величина, що не потребує термінових заходів, однак не може розглядатися як досить прийнятна";
    }
    else {
        return "Щось пійшло не так";
    }
}

// Характеристику   ризику   розвитку   неканцерогенних 
// ефектів  за  комбінованого  впливу  хімічних  речовин проводять на 
// основі розрахунку індексу небезпеки
function indexNebezpeky(E, HQ) {
    return E * HQ;
}

// Розрахунок  індивідуального канцерогенного ризику CR
function individualKancerogenRyzyk(LADD, SF) {
    return LADD * SF;
}

// При застосуванні   величини  одиничного  ризику
function individualKancerogenOdynochRyzyk(LADC, UR) {
    return LADC * UR;
}

// Одиничний ризик розраховують із  використанням  величини  SF, 
// стандартної   величини  маси  тіла  людини  (70  кг)  та  добового 
// споживання повітря (20 куб.м)
function UR(SF) {
    return (Math.pow(SF, -1) * 1) / 70 * 20;
}

// Поряд  з розрахунками індивідуального канцерогенного 
// ризику  проводять  визначення  популяційного  ризику  (PCR),  який 
// відображає додаткову (до фонової) кількість випадків новоутворень, 
// які   можуть   виникнути   протягом   життя    внаслідок    впливу 
// досліджуваного фактора
function populationRyzyk(CR, POP) {
    return CR * POP;
}

// При порівняльній характеристиці ризику  іноді  використовують 
// величину  популяційного  річного  ризику  (PCRa),  що  являє собою 
// розраховану кількість додаткових випадків раку протягом року
function velychynaPopulatRichIndex(E, C, UR, POP) {
    return E * (C * UR) * POP / 70
}

// за   впливу  декількох  канцерогенів  сумарний 
// канцерогенний ризик
function sumarnyyKancerogennyRyzyk(E, CRj) {
    return E * CRj;
}

// Класифікація рівнів ризику
let ClasyfycatsiyaRivnyvRyzyku = {
    riven_rizyku: [
        "Високий",
        "Середній",
        "Низький",
        "Мінімальний"
    ],
    ryzykProtyagomZhyttya: {
        first: pow(10, -3),
        second: [pow(10, -3), pow(10, -4)],
        third: [pow(10, -4), pow(10, -6)],
        fourth: pow(10, -6)
    }
}

// РЕКОМЕНДОВАНІ ЗНАЧЕННЯ 
// факторів експозиції
let faktorEkspozytsyy = {
    massaTila: {
        name: [
            "середній дорослий",
            "дорослий чоловік",
            "доросла жінка",
            "середня величина",
            "рекомендована ВООЗ"
        ],
        velychyna: [
            60,
            70,
            58,
            64,
            60
        ]
    },
    ploshchaPoverhnyTila: {
        name: [
            "дорослий чоловік",
            "доросла жінка"
        ],
        velychyna: [
            18000,
            16000
        ]
    },
    obyemDyhannya: {
        norma: {
            name: [
                "дорослий чоловік",
                "доросла жінка",
                "дитина (10 років)"
            ],
            velychyna: [
                3600,
                2900,
                2300
            ]
        },
        lehkaDiyalnist: {
            name: [
                "дорослий чоловік",
                "доросла жінка",
                "дитина (10 років)"
            ],
            velychyna: [
                9600,
                9100,
                6240
            ]
        }
    },
    ingalyaciyaZaDobu: {
        name: [
            "дорослий чоловік",
            "доросла жінка",
            "дитина (10 років)",
            "середній дорослий"
        ],
        velychyna: [
            23,
            21,
            15,
            22
        ]
    },
    shvidkistIngalyacii: {
        name: [
            "діти (вік 1 рік і менше)",
            "діти (вік 1-12 років)",
            "дорослі жінки",
            "дорослі чоловіки"
        ],
        velychyna: [
            4.5,
            8.7,
            11.3,
            15.2
        ]
    },
    chasUPrimishchenny: {
        name: [
            "діти 3-11 років",
            "дорослі"
        ],
        velychyna: {
            budny: [
                19,
                21
            ],
            vyhydny: [
                17,
                16.4
            ]
        }
    },
    ChasPozaPrimishchennyam: {
        name: [
            "діти 3-11 років",
            "дорослі"
        ],
        velychyna: {
            budny: [
                5,
                7
            ],
            vyhydny: [
                1.5,
                2
            ]
        }
    }
}

// РЕФЕРЕНТНІ КОНЦЕНТРАЦІЇ 
// за хронічного інгаляційного впливу 
let refConcentZaHronIngVpliv = {
    rechovyna: [
        "Азотна кислота",
        "Аміак",
        "Бензол",
        "Етанол",
        "Керосин",
        "Ртуть та сполуки",
        "Сірки діоксид",
        "Фосфор",
        "Хлор",
        "Хлорметан",
        "Хлороформ",
        "Хлоретан",
        "Ціаніди",
        "Циклогексан",
        "Цинк та сполуки"
    ],
    RfC: [
        0.04,
        0.1,
        0.06,
        100,
        0.01,
        0.003,
        0.08,
        0.00007,
        0.0002,
        0.1,
        0.098,
        10,
        0.003,
        0.28,
        0.0009
    ],
    critical: [
        "Органи дихання",
        "Органи дихання",
        "Розвиток, кров, ЦНС",
        "Органи дихання, ЦНС",
        "Печінка",
        "ЦНС",
        "Органи дихання",
        "Реп род., системн., волосся",
        "Органи дихання",
        "ЦНС",
        "Печінка, розвиток, нирки",
        "Розвиток, ШКТ",
        "Нервова сист., гормон.",
        "ЦНС, органи дихання",
        "Органи дихання"
    ]
}

// ФАКТОРИ 
// канцерогенного потенціалу
let factoryKancerPotential = {
    rechovyna: [
        "Азасерин",
        "Анілін",
        "ДДТ",
        "Кадмій",
        "Мелфалан",
        "Миш'як",
        "Нітрогліцерин",
        "Нітроген",
        "Свинець",
        "Токсафен",
        "Феназопірідин",
        "Фуріум",
        "Хлор метан",
        "Хромова кислота",
        "Етиленімін"
    ],
    SFi: [
        11,
        0.0057,
        0.34,
        6.3,
        130,
        15,
        0.014,
        0.082,
        0.042,
        1.1,
        0.17,
        1.5,
        0.0063,
        42,
        65
    ]
}